//KEBR     JOB  CLASS=C,MSGCLASS=Z
// EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSIN DD DUMMY,DCB=BLKSIZE=80
//SYSUT2 DD UNIT=10D,DISP=OLD,DCB=BLKSIZE=80
//SYSUT1 DD DATA,DLM=$$,DCB=BLKSIZE=3120
ID CMSBATCH
/JOB CMSUSER 123456 KEBR
$$
// DD DSN=K.X.CMSBATCH(MAPN),DISP=SHR
// DD DATA,DLM=$$
MAPN
KBLOCK KEBR
GETCOB
KIKMG    kebrm   mapsrc n kiksrpl kikcosys kikgcsys
K2KCOBCL kebrpgm cobol  n kiksrpl * kikcobgx
KEDFILTR kiksrpl * kebrhelp
/*
$$
//
