//TACDATA JOB  CLASS=C,MSGCLASS=A,MSGLEVEL=(1,1)
//*
//* LOAD TEST DATA FOR 'TAC' KICKS SAMPLE APPS
//*
//* STKCARDS USED BELOW IS A 'C' PROGRAM TO COPY MULTIPLE
//* SHORT (CARD IMAGE) RECORDS TO A LONGER RECORD. IT'S ALSO
//* USED TO SET LRECL AS NEEDED FOR REPRO.
//*
//* FIRST DELETE/DEFINE TACDATA
//*
//DELDEF EXEC PGM=IDCAMS,REGION=1024K
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
 DELETE KICKS.TACDATA
 DELETE KICKS.TACDATA
 DELETE K.U.TACDATA
 SET MAXCC = 0
 DEFINE CLUSTER                                       -
      (NAME(K.U.TACDATA) VOLUMES(PUB002)                     -
       TRACKS(15 15)  NONINDEXED                      -
       SHAREOPTIONS(1 3) UNIQUE                       -
       RECORDSIZE(204 204)                            -
      )                                               -
     DATA ( NAME(K.U.TACDATA.DATA))
/*
//*
//* LOAD 204 BYTE RECORDS (3 CARDS PER) INTO TACDATA
//*
//LOAD1  EXEC PGM=STKCARDS,PARM='3'
//STEPLIB  DD DSN=K.S.V1R5M0.SKIKLOAD,DISP=SHR
//SYSTERM  DD SYSOUT=*,DCB=BLKSIZE=120
//SYSPRINT DD DSN=&REPROIN,DISP=(,PASS),UNIT=SYSDA,
//         SPACE=(CYL,(1,1)),DCB=(RECFM=FB,LRECL=200,BLKSIZE=2000)
//SYSIN    DD *,DCB=BLKSIZE=80
AAR    11111111111111111111111111111111111111111111111111111111111111111
111111111111111111111111111111111111111111111111111111111111111111111111
111111111111111111111111111111111111111111111111111111111111111111111111
AAR    22222222222222222222222222222222222222222222222222222222222222222
222222222222222222222222222222222222222222222222222222222222222222222222
222222222222222222222222222222222222222222222222222222222222222222222222
AAR    44444444444444444444444444444444444444444444444444444444444444444
444444444444444444444444444444444444444444444444444444444444444444444444
444444444444444444444444444444444444444444444444444444444444444444444444
AAR    88888888888888888888888888888888888888888888888888888888888888888
888888888888888888888888888888888888888888888888888888888888888888888888
888888888888888888888888888888888888888888888888888888888888888888888888
AAR    88888888888888888888888888888888888888888888888888888888888888888
888888888888888888888888888888888888888888888888888888888888888888888888
888888888888888888888888888888888888888888888888888888888888888888888888
AAR    11111111111111111111111111111111111111111111111111111111111111111
111111111111111111111111111111111111111111111111111111111111111111111111
111111111111111111111111111111111111111111111111111111111111111111111111
AAR    66666666666666666666666666666666666666666666666666666666666666666
666666666666666666666666666666666666666666666666666666666666666666666666
666666666666666666666666666666666666666666666666666666666666666666666666
/*
//LOAD2  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//TACDATA   DD DSN=&REPROIN,DISP=(OLD,DELETE)
//SYSIN DD *
 REPRO INFILE(TACDATA) OUTDATASET(K.U.TACDATA)
/*
//
