//INSTALL  JOB CLASS=A,REGION=0K,MSGCLASS=A
//*
//STEP01 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
 DELETE 'HTTPD.LINKLIB' PURGE
 DELETE 'HTTPD.HTML' PURGE
 DELETE 'HTTPD.ICON' PURGE
 DELETE 'HTTPD.LUA' PURGE
 DELETE 'HTTPD.BREXX' PURGE
 DELETE 'HTTPD.UFSDISK0' PURGE
 SET LASTCC=0
 SET MAXCC=0
/*
//STEP02 EXEC PGM=IKJEFT01,DYNAMNBR=64
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
 RECEIVE INDATASET('YOUR UPLOAD DATASET') -
         DATASET('INSTALL.HTTPD330') -
         VOL(TK5002) NOPROMPT
 RECEIVE INDATASET('INSTALL.HTTPD330(LINKLIB)') -
         DATASET('HTTPD.LINKLIB') -
         VOL(TK5002) NOPROMPT
 RECEIVE INDATASET('INSTALL.HTTPD330(HTML)') -
         DATASET('HTTPD.HTML') -
         VOL(TK5002) NOPROMPT
 RECEIVE INDATASET('INSTALL.HTTPD330(ICON)') -
         DATASET('HTTPD.ICON') -
         VOL(TK5002) NOPROMPT
 RECEIVE INDATASET('INSTALL.HTTPD330(LUA)') -
         DATASET('HTTPD.LUA') -
         VOL(TK5002) NOPROMPT
 RECEIVE INDATASET('INSTALL.HTTPD330(BREXX)') -
         DATASET('HTTPD.BREXX') -
         VOL(TK5002) NOPROMPT
 RECEIVE INDATASET('INSTALL.HTTPD330(UFSDISK0)') -
         DATASET('HTTPD.UFSDISK0') -
         VOL(TK5002) NOPROMPT
 DELETE 'INSTALL.HTTPD330' PURGE
/*
//
