       01  INVCTL-RECORD.
      *
           05  INVCTL-RECORD-KEY               PIC X(01).
           05  INVCTL-NEXT-INVOICE-NUMBER      PIC 9(06).
      *
