//DFXX    JOB  CLASS=C,MSGCLASS=A,MSGLEVEL=(1,1),REGION=2048K
//*
//JOBPROC DD   DSN=K.S.V1R5M0.PROCLIB,DISP=SHR
//*
//DFXXP00A EXEC K2KCOBCS   S BEING FOR SOURCE TRACE...
//COPY.SYSUT1  DD DISP=SHR,DSN=K.U.V1R5M0.COB(DFXXP00A)
//LKED.SYSIN DD *
 INCLUDE SKIKLOAD(KIKCOBGL)
 ENTRY DFXXP00A
 NAME DFXXP00A(R)
/*
//
