//INQ3    JOB  CLASS=C,MSGCLASS=A,MSGLEVEL=(1,1),REGION=2048K
//*
//JOBPROC DD   DSN=K.S.V1R5M0.PROCLIB,DISP=SHR
//*
//CUSTINQ3 EXEC K2KCOBCS   S BEING FOR SOURCE TRACE...
//COPY.SYSUT1  DD DISP=SHR,DSN=K.U.V1R5M0.COB(CUSTINQ3)
//LKED.SYSIN DD *
 INCLUDE SKIKLOAD(KIKCOBGL)
 ENTRY CUSTINQ3
 NAME CUSTINQ3(R)
/*
//
