       IDENTIFICATION DIVISION.

       PROGRAM-ID.  CUSTINQ3.

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       WORKING-STORAGE SECTION.

       01  SWITCHES.

           05  VALID-DATA-SW               PIC X(01)   VALUE 'Y'.
               88  VALID-DATA                          VALUE 'Y'.
           05  CUSTOMER-FOUND-SW           PIC X(01)   VALUE 'Y'.
               88  CUSTOMER-FOUND                      VALUE 'Y'.
           05  MORE-INVOICES-SW            PIC X(01)   VALUE 'Y'.
               88  MORE-INVOICES                       VALUE 'Y'.

       01  FLAGS.

           05  DISPLAY-FLAG                PIC X(01).
               88  DISPLAY-NEW-CUSTOMER                VALUE '1'.
               88  DISPLAY-SPACES                      VALUE '2'.
               88  DISPLAY-LOW-VALUES                  VALUE '3'.
           05  SEND-FLAG                   PIC X(01).
               88  SEND-ERASE                          VALUE '1'.
               88  SEND-DATAONLY                       VALUE '2'.
               88  SEND-DATAONLY-ALARM                 VALUE '3'.

       01  WORK-FIELDS.

           05  INVOICE-SUB                 PIC S9(04) COMP.

       01  INVOICE-LINE.

           05  IL-INVOICE-NUMBER           PIC 9(06).
           05  FILLER                      PIC X(02)   VALUE SPACE.
           05  IL-PO-NUMBER                PIC X(10).
           05  FILLER                      PIC X(02)   VALUE SPACE.
           05  IL-INVOICE-DATE             PIC X(10).
           05  FILLER                      PIC X(02)   VALUE SPACE.
           05  IL-INVOICE-TOTAL            PIC Z,ZZZ,ZZ9.99.

       01  COMMUNICATION-AREA.

           05  CA-CUSTOMER-NUMBER          PIC X(06).

       01  RESPONSE-CODE                   PIC S9(08)  COMP.

       COPY CUSTMAS.

       COPY INVOICE.

      *COPY INQSET3.
       COPY INQSET3X.

       COPY KIKAID.

       COPY ERRPARM.

       LINKAGE SECTION.

       01  KIKCOMMAREA                     PIC X(06).

       PROCEDURE DIVISION.

       0000-PROCESS-CUSTOMER-INQUIRY.

           IF EIBCALEN > ZERO
               MOVE KIKCOMMAREA TO COMMUNICATION-AREA.

      *    EVALUATE TRUE

      *        WHEN EIBCALEN = ZERO
               IF EIBCALEN = ZERO
                   MOVE LOW-VALUE TO CA-CUSTOMER-NUMBER
                   MOVE LOW-VALUE TO CUSTOMER-INQUIRY-MAP
      *            SET SEND-ERASE TO TRUE
                   MOVE '1' TO SEND-FLAG
                   PERFORM 1500-SEND-INQUIRY-MAP

      *        WHEN EIBAID = KIKCLEAR
               ELSE
               IF EIBAID = KIKCLEAR
                   MOVE LOW-VALUE TO CA-CUSTOMER-NUMBER
                   MOVE LOW-VALUE TO CUSTOMER-INQUIRY-MAP
      *            SET SEND-ERASE TO TRUE
                   MOVE '1' TO SEND-FLAG
                   PERFORM 1500-SEND-INQUIRY-MAP

      *        WHEN EIBAID = DFHPA1 OR DFHPA2 OR DFHPA3
      *           CONTINUE -- let these fall into 'other'...

      *        WHEN EIBAID = KIKPF3 OR KIKPF12
               ELSE
               IF EIBAID = KIKPF3 OR KIKPF12
                   EXEC KICKS
                       XCTL PROGRAM('INVMENU')
                   END-EXEC

      *        WHEN EIBAID = KIKENTER
               ELSE
               IF EIBAID = KIKENTER
                   PERFORM 1000-DISPLAY-SELECTED-CUSTOMER

      *        WHEN EIBAID = KIKPF5
               ELSE
               IF EIBAID = KIKPF5
                   PERFORM 2000-DISPLAY-FIRST-CUSTOMER

      *        WHEN EIBAID = KIKPF6
               ELSE
               IF EIBAID = KIKPF6
                   PERFORM 3000-DISPLAY-LAST-CUSTOMER

      *        WHEN EIBAID = KIKPF7
               ELSE
               IF EIBAID = KIKPF7
                   PERFORM 4000-DISPLAY-PREV-CUSTOMER

      *        WHEN EIBAID = KIKPF8
               ELSE
               IF EIBAID = KIKPF8
                   PERFORM 5000-DISPLAY-NEXT-CUSTOMER

      *        WHEN OTHER
               ELSE
                   MOVE LOW-VALUE TO CUSTOMER-INQUIRY-MAP
                   MOVE 'Invalid key pressed.' TO CIM-D-MESSAGE
      *            SET SEND-DATAONLY-ALARM TO TRUE
                   MOVE '3' TO SEND-FLAG
                   PERFORM 1500-SEND-INQUIRY-MAP.

      *    END-EVALUATE.

           EXEC KICKS
               RETURN TRANSID('INQ3')
                      COMMAREA(COMMUNICATION-AREA)
           END-EXEC.

       1000-DISPLAY-SELECTED-CUSTOMER.

           PERFORM 1100-RECEIVE-INQUIRY-MAP.
           PERFORM 1200-EDIT-CUSTOMER-NUMBER.
           IF VALID-DATA
               PERFORM 1300-READ-CUSTOMER-RECORD
               PERFORM XXXX-UNNESTED-1
           ELSE
      *        SET DISPLAY-LOW-VALUES TO TRUE
               MOVE '3' TO DISPLAY-FLAG
               PERFORM 1400-DISPLAY-INQUIRY-RESULTS.

       1100-RECEIVE-INQUIRY-MAP.

           EXEC KICKS
               RECEIVE MAP('INQMAP3')
                       MAPSET('INQSET3')
                       INTO(CUSTOMER-INQUIRY-MAP)
           END-EXEC.

      *    INSPECT CUSTOMER-INQUIRY-MAP
           EXAMINE CUSTOMER-INQUIRY-MAP
               REPLACING ALL '_' BY SPACE.

       1200-EDIT-CUSTOMER-NUMBER.

           IF       CIM-L-CUSTNO = ZERO
                 OR CIM-D-CUSTNO = SPACE
               MOVE 'N' TO VALID-DATA-SW
               MOVE 'You must enter a customer number.'
                   TO CIM-D-MESSAGE.

       1300-READ-CUSTOMER-RECORD.

           EXEC KICKS
               READ FILE('CUSTMAS')
                    INTO(CUSTOMER-MASTER-RECORD)
                    RIDFLD(CIM-D-CUSTNO)
                    RESP(RESPONSE-CODE)
           END-EXEC.

           IF RESPONSE-CODE = KIKRESP(NOTFND)
               MOVE 'N' TO CUSTOMER-FOUND-SW
               MOVE 'That customer does not exist.' TO CIM-D-MESSAGE
           ELSE
               PERFORM XXXX-UNNESTED-2.

       1400-DISPLAY-INQUIRY-RESULTS.

      *    EVALUATE TRUE
      *        WHEN DISPLAY-NEW-CUSTOMER
               IF DISPLAY-NEW-CUSTOMER
                   MOVE CM-CUSTOMER-NUMBER TO CIM-D-CUSTNO
                   MOVE CM-LAST-NAME       TO CIM-D-LNAME
                   MOVE CM-FIRST-NAME      TO CIM-D-FNAME
                   MOVE CM-ADDRESS         TO CIM-D-ADDR
                   MOVE CM-CITY            TO CIM-D-CITY
                   MOVE CM-STATE           TO CIM-D-STATE
                   MOVE CM-ZIP-CODE        TO CIM-D-ZIPCODE
                   MOVE SPACE              TO CIM-D-MESSAGE
                   PERFORM 1410-START-INVOICE-BROWSE
                   PERFORM 1420-FORMAT-INVOICE-LINE
                       VARYING INVOICE-SUB FROM 1 BY 1
                       UNTIL INVOICE-SUB > 10
                   PERFORM 1440-END-INVOICE-BROWSE
      *            SET SEND-DATAONLY TO TRUE
                   MOVE '2' TO SEND-FLAG
      *        WHEN DISPLAY-SPACES
               ELSE
               IF DISPLAY-SPACES
                   MOVE LOW-VALUE TO CIM-D-CUSTNO
                   MOVE SPACE     TO CIM-D-LNAME
                                     CIM-D-FNAME
                                     CIM-D-ADDR
                                     CIM-D-CITY
                                     CIM-D-STATE
                                     CIM-D-ZIPCODE
                   PERFORM 1405-PERFORMED-PAR
                           VARYING INVOICE-SUB FROM 1 BY 1
                           UNTIL INVOICE-SUB > 10
      *            SET SEND-DATAONLY-ALARM TO TRUE
                   MOVE '3' TO SEND-FLAG
      *        WHEN DISPLAY-LOW-VALUES
               ELSE
               IF DISPLAY-LOW-VALUES
      *                SET SEND-DATAONLY-ALARM TO TRUE
                       MOVE '3' TO SEND-FLAG.
      *    END-EVALUATE.
           PERFORM 1500-SEND-INQUIRY-MAP.

       1405-PERFORMED-PAR.
           MOVE SPACE TO CIM-D-INVOICE-LINE(INVOICE-SUB).

       1410-START-INVOICE-BROWSE.

           EXEC KICKS
               STARTBR FILE('INVPATH')
                       RIDFLD(CM-CUSTOMER-NUMBER)
                       EQUAL
                       RESP(RESPONSE-CODE)
           END-EXEC.

           IF RESPONSE-CODE = KIKRESP(NOTFND)
               MOVE 'N' TO MORE-INVOICES-SW
           ELSE
               PERFORM XXXX-UNNESTED-3.

       1420-FORMAT-INVOICE-LINE.

           IF MORE-INVOICES
               PERFORM 1430-READ-NEXT-INVOICE
               MOVE INV-INVOICE-NUMBER TO IL-INVOICE-NUMBER
               MOVE INV-PO-NUMBER      TO IL-PO-NUMBER
               MOVE INV-INVOICE-DATE   TO IL-INVOICE-DATE
               EXAMINE IL-INVOICE-DATE REPLACING ALL '-' BY '/'
               MOVE INV-INVOICE-TOTAL  TO IL-INVOICE-TOTAL
               MOVE INVOICE-LINE      TO CIM-D-INVOICE-LINE(INVOICE-SUB)
           ELSE
               MOVE SPACE             TO CIM-D-INVOICE-LINE(INVOICE-SUB).

       1430-READ-NEXT-INVOICE.

           EXEC KICKS
               READNEXT FILE('INVPATH')
                        RIDFLD(CM-CUSTOMER-NUMBER)
                        INTO(INVOICE-RECORD)
                        RESP(RESPONSE-CODE)
           END-EXEC.

           IF RESPONSE-CODE = KIKRESP(NORMAL)
               MOVE 'N' TO MORE-INVOICES-SW
           ELSE
               PERFORM XXXX-UNNESTED-4.

       1440-END-INVOICE-BROWSE.

           EXEC KICKS
               ENDBR FILE('INVPATH')
                     RESP(RESPONSE-CODE)
           END-EXEC.

      *    IF RESPONSE-CODE NOT = DFHRESP(NORMAL)
      *        PERFORM 9999-TERMINATE-PROGRAM
      *    END-IF.

       1500-SEND-INQUIRY-MAP.

           MOVE 'INQ3' TO CIM-D-TRANID.

      *    EVALUATE TRUE
      *        WHEN SEND-ERASE
               IF SEND-ERASE
                   EXEC KICKS
                       SEND MAP('INQMAP3')
                            MAPSET('INQSET3')
                            FROM(CUSTOMER-INQUIRY-MAP)
                            ERASE
                   END-EXEC
      *        WHEN SEND-DATAONLY
               ELSE
               IF SEND-DATAONLY
                   EXEC KICKS
                       SEND MAP('INQMAP3')
                            MAPSET('INQSET3')
                            FROM(CUSTOMER-INQUIRY-MAP)
                            DATAONLY
                   END-EXEC
      *        WHEN SEND-DATAONLY-ALARM
               ELSE
               IF SEND-DATAONLY-ALARM
                   EXEC KICKS
                       SEND MAP('INQMAP3')
                            MAPSET('INQSET3')
                            FROM(CUSTOMER-INQUIRY-MAP)
                            DATAONLY
                            ALARM
                   END-EXEC.
      *    END-EVALUATE.

       2000-DISPLAY-FIRST-CUSTOMER.

           MOVE LOW-VALUE TO CM-CUSTOMER-NUMBER
                             CUSTOMER-INQUIRY-MAP.
           PERFORM 2100-START-CUSTOMER-BROWSE.
           IF CUSTOMER-FOUND
               PERFORM 2200-READ-NEXT-CUSTOMER.
           PERFORM 2300-END-CUSTOMER-BROWSE.
           IF CUSTOMER-FOUND
      *        SET DISPLAY-NEW-CUSTOMER TO TRUE
               MOVE '1' TO DISPLAY-FLAG
               PERFORM 1400-DISPLAY-INQUIRY-RESULTS
               MOVE CM-CUSTOMER-NUMBER TO CA-CUSTOMER-NUMBER
           ELSE
      *        SET DISPLAY-SPACES TO TRUE
               MOVE '2' TO DISPLAY-FLAG
               PERFORM 1400-DISPLAY-INQUIRY-RESULTS.

       2100-START-CUSTOMER-BROWSE.

           EXEC KICKS
               STARTBR FILE('CUSTMAS')
                       RIDFLD(CM-CUSTOMER-NUMBER)
                       RESP(RESPONSE-CODE)
           END-EXEC.

           IF RESPONSE-CODE = KIKRESP(NORMAL)
               MOVE 'Y' TO CUSTOMER-FOUND-SW
               MOVE SPACE TO CIM-D-MESSAGE
           ELSE
               PERFORM XXXX-UNNESTED-5.

       2200-READ-NEXT-CUSTOMER.

           EXEC KICKS
               READNEXT FILE('CUSTMAS')
                        INTO(CUSTOMER-MASTER-RECORD)
                        RIDFLD(CM-CUSTOMER-NUMBER)
                        RESP(RESPONSE-CODE)
           END-EXEC.

           IF RESPONSE-CODE = KIKRESP(NORMAL)
               MOVE 'Y' TO CUSTOMER-FOUND-SW
           ELSE
               PERFORM XXXX-UNNESTED-6.

       2300-END-CUSTOMER-BROWSE.

           EXEC KICKS
               ENDBR FILE('CUSTMAS')
               RESP(RESPONSE-CODE)
           END-EXEC.

      *    IF RESPONSE-CODE NOT = DFHRESP(NORMAL)
      *        PERFORM 9999-TERMINATE-PROGRAM
      *    END-IF.

       3000-DISPLAY-LAST-CUSTOMER.

           MOVE HIGH-VALUE TO CM-CUSTOMER-NUMBER.
           MOVE LOW-VALUE  TO CUSTOMER-INQUIRY-MAP.
           PERFORM 2100-START-CUSTOMER-BROWSE.
           IF CUSTOMER-FOUND
               PERFORM 3100-READ-PREV-CUSTOMER.
           PERFORM 2300-END-CUSTOMER-BROWSE.
           IF CUSTOMER-FOUND
      *        SET DISPLAY-NEW-CUSTOMER TO TRUE
               MOVE '1' TO DISPLAY-FLAG
               PERFORM 1400-DISPLAY-INQUIRY-RESULTS
               MOVE CM-CUSTOMER-NUMBER TO CA-CUSTOMER-NUMBER
           ELSE
      *        SET DISPLAY-SPACES TO TRUE
               MOVE '2' TO DISPLAY-FLAG
               PERFORM 1400-DISPLAY-INQUIRY-RESULTS.

       3100-READ-PREV-CUSTOMER.

           EXEC KICKS
               READPREV FILE('CUSTMAS')
                        INTO(CUSTOMER-MASTER-RECORD)
                        RIDFLD(CM-CUSTOMER-NUMBER)
                        RESP(RESPONSE-CODE)
           END-EXEC.

           IF RESPONSE-CODE = KIKRESP(NORMAL)
               MOVE 'Y' TO CUSTOMER-FOUND-SW
           ELSE
               PERFORM XXXX-UNNESTED-7.

       4000-DISPLAY-PREV-CUSTOMER.

           MOVE CA-CUSTOMER-NUMBER TO CM-CUSTOMER-NUMBER.
           MOVE LOW-VALUE          TO CUSTOMER-INQUIRY-MAP.
           PERFORM 2100-START-CUSTOMER-BROWSE.
           IF CUSTOMER-FOUND
               PERFORM 2200-READ-NEXT-CUSTOMER
               PERFORM 3100-READ-PREV-CUSTOMER
               PERFORM 3100-READ-PREV-CUSTOMER.
           PERFORM 2300-END-CUSTOMER-BROWSE.
           IF CUSTOMER-FOUND
      *        SET DISPLAY-NEW-CUSTOMER TO TRUE
               MOVE '1' TO DISPLAY-FLAG
               PERFORM 1400-DISPLAY-INQUIRY-RESULTS
               MOVE CM-CUSTOMER-NUMBER TO CA-CUSTOMER-NUMBER
           ELSE
      *        SET DISPLAY-LOW-VALUES TO TRUE
               MOVE '3' TO DISPLAY-FLAG
               PERFORM 1400-DISPLAY-INQUIRY-RESULTS.

       5000-DISPLAY-NEXT-CUSTOMER.

           MOVE CA-CUSTOMER-NUMBER TO CM-CUSTOMER-NUMBER.
           MOVE LOW-VALUE          TO CUSTOMER-INQUIRY-MAP.
           PERFORM 2100-START-CUSTOMER-BROWSE.
           IF CUSTOMER-FOUND
               PERFORM 2200-READ-NEXT-CUSTOMER
               PERFORM 2200-READ-NEXT-CUSTOMER.
           PERFORM 2300-END-CUSTOMER-BROWSE.
           IF CUSTOMER-FOUND
      *        SET DISPLAY-NEW-CUSTOMER TO TRUE
               MOVE '1' TO DISPLAY-FLAG
               PERFORM 1400-DISPLAY-INQUIRY-RESULTS
               MOVE CM-CUSTOMER-NUMBER TO CA-CUSTOMER-NUMBER
           ELSE
      *        SET DISPLAY-LOW-VALUES TO TRUE
               MOVE '3' TO DISPLAY-FLAG
               PERFORM 1400-DISPLAY-INQUIRY-RESULTS.

       9999-TERMINATE-PROGRAM.

           MOVE EIBRESP  TO ERR-RESP.
           MOVE EIBRESP2 TO ERR-RESP2.
           MOVE EIBTRNID TO ERR-TRNID.
           MOVE EIBRSRCE TO ERR-RSRCE.

           EXEC KICKS
               XCTL PROGRAM('SYSERR')
                    COMMAREA(ERROR-PARAMETERS)
           END-EXEC.

       XXXX-UNNESTED SECTION.

       XXXX-UNNESTED-1.
               IF CUSTOMER-FOUND
      *            SET DISPLAY-NEW-CUSTOMER TO TRUE
                   MOVE '1' TO DISPLAY-FLAG
                   PERFORM 1400-DISPLAY-INQUIRY-RESULTS
                   MOVE CM-CUSTOMER-NUMBER TO CA-CUSTOMER-NUMBER
               ELSE
      *            SET DISPLAY-SPACES TO TRUE
                   MOVE '2' TO DISPLAY-FLAG
                   PERFORM 1400-DISPLAY-INQUIRY-RESULTS.

       XXXX-UNNESTED-2.
               IF RESPONSE-CODE NOT = KIKRESP(NORMAL)
                   PERFORM 9999-TERMINATE-PROGRAM.

       XXXX-UNNESTED-3.
               IF RESPONSE-CODE NOT = KIKRESP(NORMAL)
                   PERFORM 9999-TERMINATE-PROGRAM.

       XXXX-UNNESTED-4.
               IF RESPONSE-CODE NOT = KIKRESP(DUPKEY)
                   PERFORM 9999-TERMINATE-PROGRAM.

       XXXX-UNNESTED-5.
               IF RESPONSE-CODE = KIKRESP(NOTFND)
                   MOVE 'N' TO CUSTOMER-FOUND-SW
                   MOVE 'There are no customers in the file.'
                       TO CIM-D-MESSAGE
               ELSE
                   PERFORM 9999-TERMINATE-PROGRAM.

       XXXX-UNNESTED-6.
               IF RESPONSE-CODE = KIKRESP(ENDFILE)
                   MOVE 'N' TO CUSTOMER-FOUND-SW
                   MOVE 'There are no more records in the file.'
                       TO CIM-D-MESSAGE
              ELSE
                   PERFORM 9999-TERMINATE-PROGRAM.

       XXXX-UNNESTED-7.
               IF RESPONSE-CODE = KIKRESP(ENDFILE)
                   MOVE 'N' TO CUSTOMER-FOUND-SW
                   MOVE 'There are no more records in the file.'
                       TO CIM-D-MESSAGE
               ELSE
                   PERFORM 9999-TERMINATE-PROGRAM.
