       IDENTIFICATION DIVISION.

       PROGRAM-ID.  CUSTMNT2.

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       WORKING-STORAGE SECTION.

       01  SWITCHES.

           05  VALID-DATA-SW                 PIC X(01) VALUE 'Y'.
               88  VALID-DATA                          VALUE 'Y'.

       01  FLAGS.

           05  SEND-FLAG                     PIC X(01).
               88  SEND-ERASE                       VALUE '1'.
               88  SEND-ERASE-ALARM                 VALUE '2'.
               88  SEND-DATAONLY                    VALUE '3'.
               88  SEND-DATAONLY-ALARM              VALUE '4'.

       01  WORK-FIELDS.

           05  RESPONSE-CODE                 PIC S9(08) COMP.

       01  USER-INSTRUCTIONS.

           05  ADD-INSTRUCTION               PIC X(79) VALUE
               'Type information for new customer.  Then Press Enter.'.
           05  CHANGE-INSTRUCTION            PIC X(79) VALUE
               'Type changes.  Then press Enter.'.
           05  DELETE-INSTRUCTION            PIC X(79) VALUE
               'Press Enter to delete this customer or press F12 to canc
      -        'el.'.

       01  COMMUNICATION-AREA.

           05  CA-CONTEXT-FLAG               PIC X(01).
               88  PROCESS-KEY-MAP                  VALUE '1'.
               88  PROCESS-ADD-CUSTOMER             VALUE '2'.
               88  PROCESS-CHANGE-CUSTOMER          VALUE '3'.
               88  PROCESS-DELETE-CUSTOMER          VALUE '4'.
           05  CA-CUSTOMER-RECORD.
               10  CA-CUSTOMER-NUMBER        PIC X(06).
               10  FILLER                    PIC X(112).

       COPY CUSTMAS.

       COPY MNTSET2.

       COPY KIKAID.

       COPY ATTR.

       COPY ERRPARM.

       LINKAGE SECTION.

       01  KIKCOMMAREA                       PIC X(119).

       PROCEDURE DIVISION.

       0000-PROCESS-CUSTOMER-MAINT.

           IF EIBCALEN > ZERO
               MOVE KIKCOMMAREA TO COMMUNICATION-AREA.

      *    EVALUATE TRUE

      *        WHEN EIBCALEN = ZERO
               IF EIBCALEN = ZERO
                   MOVE LOW-VALUE TO MNTMAP1O
                   MOVE -1 TO CUSTNO1L
      *            SET SEND-ERASE TO TRUE
                   MOVE '1' TO SEND-FLAG
                   PERFORM 1500-SEND-KEY-MAP
      *            SET PROCESS-KEY-MAP TO TRUE
                   MOVE '1' TO CA-CONTEXT-FLAG

      *        WHEN EIBAID = KIKPF3
               ELSE
               IF EIBAID = KIKPF3
                   EXEC KICKS
                       XCTL PROGRAM('INVMENU')
                   END-EXEC

      *        WHEN EIBAID = KIKPF12
               ELSE
               IF EIBAID = KIKPF12
                   PERFORM XXXX-UNNESTED-11

      *        WHEN EIBAID = KIKCLEAR
               ELSE
               IF EIBAID = KIKCLEAR
                   PERFORM XXXX-UNNESTED-12

      *        WHEN EIBAID = DFHPA1 OR DFHPA2 OR DFHPA3
      *           CONTINUE -- let these fall into 'other'...

      *        WHEN EIBAID = KIKENTER
               ELSE
               IF EIBAID = KIKENTER
                   PERFORM XXXX-UNNESTED-2

      *        WHEN OTHER
               ELSE
                   PERFORM XXXX-UNNESTED-13.

      *    END-EVALUATE.

           EXEC KICKS
               RETURN TRANSID('MNT2')
                      COMMAREA(COMMUNICATION-AREA)
           END-EXEC.

       1000-PROCESS-KEY-MAP.

           PERFORM 1100-RECEIVE-KEY-MAP.
           PERFORM 1200-EDIT-KEY-DATA.
           IF VALID-DATA
               PERFORM XXXX-UNNESTED-3
               MOVE CUSTNO1I      TO CUSTNO2O
               MOVE CM-LAST-NAME  TO LNAMEO
               MOVE CM-FIRST-NAME TO FNAMEO
               MOVE CM-ADDRESS    TO ADDRO
               MOVE CM-CITY       TO CITYO
               MOVE CM-STATE      TO STATEO
               MOVE CM-ZIP-CODE   TO ZIPCODEO
               MOVE -1 TO LNAMEL
      *        SET SEND-ERASE TO TRUE
               MOVE '1' TO SEND-FLAG
               PERFORM 1400-SEND-DATA-MAP
           ELSE
               MOVE LOW-VALUE TO CUSTNO1O
                                 ACTIONO
      *        SET SEND-DATAONLY-ALARM TO TRUE
               MOVE '4' TO SEND-FLAG
               PERFORM 1500-SEND-KEY-MAP.

       1100-RECEIVE-KEY-MAP.

           EXEC KICKS
               RECEIVE MAP('MNTMAP1')
                       MAPSET('MNTSET2')
                       INTO(MNTMAP1I)
           END-EXEC.

      *    INSPECT MNTMAP1I
           EXAMINE MNTMAP1I
               REPLACING ALL '_' BY SPACE.

       1200-EDIT-KEY-DATA.

           MOVE ATTR-NO-HIGHLIGHT TO ACTIONH
                                     CUSTNO1H.

           IF ACTIONI NOT = '1' AND '2' AND '3'
               MOVE ATTR-REVERSE TO ACTIONH
               MOVE -1 TO ACTIONL
               MOVE 'Action must be 1, 2, or 3.' TO MSG1O
               MOVE 'N' TO VALID-DATA-SW.

           IF       CUSTNO1L = ZERO
                 OR CUSTNO1I = SPACE
               MOVE ATTR-REVERSE TO CUSTNO1H
               MOVE -1 TO CUSTNO1L
               MOVE 'You must enter a customer number.' TO MSG1O
               MOVE 'N' TO VALID-DATA-SW.

           IF VALID-DATA
               MOVE LOW-VALUE TO MNTMAP2O
      *        EVALUATE ACTIONI
      *            WHEN '1'
                   IF ACTIONI EQUAL '1'
                       PERFORM 1300-READ-CUSTOMER-RECORD
                       PERFORM XXXX-UNNESTED-15
      *            WHEN '2'
                   ELSE
                   IF ACTIONI EQUAL '2'
                       PERFORM 1300-READ-CUSTOMER-RECORD
                       PERFORM XXXX-UNNESTED-17
      *            WHEN '3'
                   ELSE
                   IF ACTIONI EQUAL '3'
                       PERFORM 1300-READ-CUSTOMER-RECORD
                       PERFORM XXXX-UNNESTED-19.
      *        END-EVALUATE.

       1300-READ-CUSTOMER-RECORD.

           EXEC KICKS
               READ FILE('CUSTMAS')
                    INTO(CUSTOMER-MASTER-RECORD)
                    RIDFLD(CUSTNO1I)
                    RESP(RESPONSE-CODE)
           END-EXEC.

           IF      RESPONSE-CODE NOT = KIKRESP(NORMAL)
               AND RESPONSE-CODE NOT = KIKRESP(NOTFND)
               PERFORM 9999-TERMINATE-PROGRAM.

       1400-SEND-DATA-MAP.

           MOVE 'MNT2' TO TRANID2O.

      *    EVALUATE TRUE
      *        WHEN SEND-ERASE
               IF SEND-ERASE
                   EXEC KICKS
                       SEND MAP('MNTMAP2')
                            MAPSET('MNTSET2')
                            FROM(MNTMAP2O)
                            ERASE
                            CURSOR
                   END-EXEC
      *        WHEN SEND-DATAONLY-ALARM
               ELSE
               IF SEND-DATAONLY-ALARM
                   EXEC KICKS
                       SEND MAP('MNTMAP2')
                            MAPSET('MNTSET2')
                            FROM(MNTMAP2O)
                            DATAONLY
                            ALARM
                            CURSOR
               END-EXEC.
      *    END-EVALUATE.

       1500-SEND-KEY-MAP.

           MOVE 'MNT2' TO TRANID1O.

      *    EVALUATE TRUE
      *        WHEN SEND-ERASE
               IF SEND-ERASE
                   EXEC KICKS
                       SEND MAP('MNTMAP1')
                            MAPSET('MNTSET2')
                            FROM(MNTMAP1O)
                            ERASE
                            CURSOR
                   END-EXEC
      *        WHEN SEND-ERASE-ALARM
               ELSE
               IF SEND-ERASE-ALARM
                   EXEC KICKS
                       SEND MAP('MNTMAP1')
                            MAPSET('MNTSET2')
                            FROM(MNTMAP1O)
                            ERASE
                            ALARM
                            CURSOR
                   END-EXEC
      *        WHEN SEND-DATAONLY-ALARM
               ELSE
               IF SEND-DATAONLY-ALARM
                   EXEC KICKS
                       SEND MAP('MNTMAP1')
                            MAPSET('MNTSET2')
                            FROM(MNTMAP1O)
                            DATAONLY
                            ALARM
                            CURSOR
                   END-EXEC.
      *    END-EVALUATE.

       2000-PROCESS-ADD-CUSTOMER.

           PERFORM 2100-RECEIVE-DATA-MAP.
           PERFORM 2200-EDIT-CUSTOMER-DATA.
           IF VALID-DATA
               PERFORM 2300-WRITE-CUSTOMER-RECORD
               PERFORM XXXX-UNNESTED-4
               MOVE -1 TO CUSTNO1L
               PERFORM 1500-SEND-KEY-MAP
      *        SET PROCESS-KEY-MAP TO TRUE
               MOVE '1' TO CA-CONTEXT-FLAG
           ELSE
               MOVE LOW-VALUE TO LNAMEO
                                 FNAMEO
                                 ADDRO
                                 CITYO
                                 STATEO
                                 ZIPCODEO
      *        SET SEND-DATAONLY-ALARM TO TRUE
               MOVE '4' TO SEND-FLAG
               PERFORM 1400-SEND-DATA-MAP.

       2100-RECEIVE-DATA-MAP.

           EXEC KICKS
               RECEIVE MAP('MNTMAP2')
                       MAPSET('MNTSET2')
                       INTO(MNTMAP2I)
           END-EXEC.

      *    INSPECT MNTMAP2I
           EXAMINE MNTMAP2I
               REPLACING ALL '_' BY SPACE.

       2200-EDIT-CUSTOMER-DATA.

           MOVE ATTR-NO-HIGHLIGHT TO ZIPCODEH
                                     STATEH
                                     CITYH
                                     ADDRH
                                     FNAMEH
                                     LNAMEH.

           IF       ZIPCODEI = SPACE
                 OR ZIPCODEL = ZERO
               MOVE ATTR-REVERSE TO ZIPCODEH
               MOVE -1 TO ZIPCODEL
               MOVE 'You must enter a zip code.' TO MSG2O
               MOVE 'N' TO VALID-DATA-SW.

           IF       STATEI = SPACE
                 OR STATEL = ZERO
               MOVE ATTR-REVERSE TO STATEH
               MOVE -1 TO STATEL
               MOVE 'You must enter a state.' TO MSG2O
               MOVE 'N' TO VALID-DATA-SW.

           IF       CITYI = SPACE
                 OR CITYL = ZERO
               MOVE ATTR-REVERSE TO CITYH
               MOVE -1 TO CITYL
               MOVE 'You must enter a city.' TO MSG2O
               MOVE 'N' TO VALID-DATA-SW.

           IF       ADDRI = SPACE
                 OR ADDRL = ZERO
               MOVE ATTR-REVERSE TO ADDRH
               MOVE -1 TO ADDRL
               MOVE 'You must enter an address.' TO MSG2O
               MOVE 'N' TO VALID-DATA-SW.

           IF       FNAMEI = SPACE
                 OR FNAMEL = ZERO
               MOVE ATTR-REVERSE TO FNAMEH
               MOVE -1 TO FNAMEL
               MOVE 'You must enter a first name.' TO MSG2O
               MOVE 'N' TO VALID-DATA-SW.

           IF       LNAMEI = SPACE
                 OR LNAMEL = ZERO
               MOVE ATTR-REVERSE TO LNAMEH
               MOVE -1 TO LNAMEL
               MOVE 'You must enter a last name.' TO MSG2O
               MOVE 'N' TO VALID-DATA-SW.

       2300-WRITE-CUSTOMER-RECORD.

           MOVE CUSTNO2I TO CM-CUSTOMER-NUMBER.
           MOVE LNAMEI   TO CM-LAST-NAME.
           MOVE FNAMEI   TO CM-FIRST-NAME.
           MOVE ADDRI    TO CM-ADDRESS.
           MOVE CITYI    TO CM-CITY.
           MOVE STATEI   TO CM-STATE.
           MOVE ZIPCODEI TO CM-ZIP-CODE.

           EXEC KICKS
               WRITE FILE('CUSTMAS')
                     FROM(CUSTOMER-MASTER-RECORD)
                     RIDFLD(CM-CUSTOMER-NUMBER)
                     RESP(RESPONSE-CODE)
           END-EXEC.

           IF      RESPONSE-CODE NOT = KIKRESP(NORMAL)
               AND RESPONSE-CODE NOT = KIKRESP(DUPREC)
               PERFORM 9999-TERMINATE-PROGRAM.

       3000-PROCESS-CHANGE-CUSTOMER.

           PERFORM 2100-RECEIVE-DATA-MAP.
           PERFORM 2200-EDIT-CUSTOMER-DATA.
           IF VALID-DATA
               MOVE CUSTNO2I TO CM-CUSTOMER-NUMBER
               PERFORM 3100-READ-CUSTOMER-FOR-UPDATE
               PERFORM XXXX-UNNESTED-5
               MOVE -1 TO CUSTNO1L
               PERFORM 1500-SEND-KEY-MAP
      *        SET PROCESS-KEY-MAP TO TRUE
               MOVE '1' TO CA-CONTEXT-FLAG
           ELSE
               MOVE LOW-VALUE TO LNAMEO
                                 FNAMEO
                                 ADDRO
                                 CITYO
                                 STATEO
                                 ZIPCODEO
      *        SET SEND-DATAONLY-ALARM TO TRUE
               MOVE '4' TO SEND-FLAG
               PERFORM 1400-SEND-DATA-MAP.

       3100-READ-CUSTOMER-FOR-UPDATE.

           EXEC KICKS
               READ FILE('CUSTMAS')
                    INTO(CUSTOMER-MASTER-RECORD)
                    RIDFLD(CM-CUSTOMER-NUMBER)
                    UPDATE
                    RESP(RESPONSE-CODE)
           END-EXEC.

           IF      RESPONSE-CODE NOT = KIKRESP(NORMAL)
               AND RESPONSE-CODE NOT = KIKRESP(NOTFND)
               PERFORM 9999-TERMINATE-PROGRAM.

       3200-REWRITE-CUSTOMER-RECORD.

           MOVE LNAMEI   TO CM-LAST-NAME.
           MOVE FNAMEI   TO CM-FIRST-NAME.
           MOVE ADDRI    TO CM-ADDRESS.
           MOVE CITYI    TO CM-CITY.
           MOVE STATEI   TO CM-STATE.
           MOVE ZIPCODEI TO CM-ZIP-CODE.

           EXEC KICKS
               REWRITE FILE('CUSTMAS')
                       FROM(CUSTOMER-MASTER-RECORD)
                       RESP(RESPONSE-CODE)
           END-EXEC.

           IF RESPONSE-CODE NOT = KIKRESP(NORMAL)
               PERFORM 9999-TERMINATE-PROGRAM.

       4000-PROCESS-DELETE-CUSTOMER.

           MOVE CA-CUSTOMER-NUMBER TO CM-CUSTOMER-NUMBER.
           PERFORM 3100-READ-CUSTOMER-FOR-UPDATE.
           IF RESPONSE-CODE = KIKRESP(NORMAL)
               PERFORM XXXX-UNNESTED-6
           ELSE
               PERFORM XXXX-UNNESTED-7.
           MOVE -1 TO CUSTNO1L.
           PERFORM 1500-SEND-KEY-MAP.
      *    SET PROCESS-KEY-MAP TO TRUE.
           MOVE '1' TO CA-CONTEXT-FLAG.

       4100-DELETE-CUSTOMER-RECORD.

           EXEC KICKS
               DELETE FILE('CUSTMAS')
                      RESP(RESPONSE-CODE)
           END-EXEC.

           IF  RESPONSE-CODE NOT = KIKRESP(NORMAL)
               PERFORM 9999-TERMINATE-PROGRAM.

       9999-TERMINATE-PROGRAM.

           MOVE EIBRESP  TO ERR-RESP.
           MOVE EIBRESP2 TO ERR-RESP2.
           MOVE EIBTRNID TO ERR-TRNID.
           MOVE EIBRSRCE TO ERR-RSRCE.

           EXEC KICKS
               XCTL PROGRAM('SYSERR')
                    COMMAREA(ERROR-PARAMETERS)
           END-EXEC.

       XXXX-UNNESTED SECTION.

       XXXX-UNNESTED-1.
      *                EVALUATE TRUE
      *                    WHEN PROCESS-ADD-CUSTOMER
                           IF PROCESS-ADD-CUSTOMER
                               MOVE ADD-INSTRUCTION    TO INSTR2O
      *                    WHEN PROCESS-CHANGE-CUSTOMER
                           ELSE
                           IF PROCESS-CHANGE-CUSTOMER
                               MOVE CHANGE-INSTRUCTION TO INSTR2O
      *                    WHEN PROCESS-DELETE-CUSTOMER
                           ELSE
                           IF PROCESS-DELETE-CUSTOMER
                               MOVE DELETE-INSTRUCTION TO INSTR2O.
      *                END-EVALUATE.

       XXXX-UNNESTED-2.
      *            EVALUATE TRUE
      *                WHEN PROCESS-KEY-MAP
                       IF PROCESS-KEY-MAP
                           PERFORM 1000-PROCESS-KEY-MAP
      *                WHEN PROCESS-ADD-CUSTOMER
                       ELSE
                       IF PROCESS-ADD-CUSTOMER
                           PERFORM 2000-PROCESS-ADD-CUSTOMER
      *                WHEN PROCESS-CHANGE-CUSTOMER
                       ELSE
                       IF PROCESS-CHANGE-CUSTOMER
                           PERFORM 3000-PROCESS-CHANGE-CUSTOMER
      *                WHEN PROCESS-DELETE-CUSTOMER
                       ELSE
                       IF PROCESS-DELETE-CUSTOMER
                           PERFORM 4000-PROCESS-DELETE-CUSTOMER.
      *            END-EVALUATE.

       XXXX-UNNESTED-3.
               IF NOT PROCESS-DELETE-CUSTOMER
      *            INSPECT CUSTOMER-MASTER-RECORD
                   EXAMINE CUSTOMER-MASTER-RECORD
                       REPLACING ALL SPACE BY '_'.

       XXXX-UNNESTED-4.
               IF RESPONSE-CODE = KIKRESP(NORMAL)
                   MOVE 'Customer record added.' TO MSG1O
      *            SET SEND-ERASE TO TRUE
                   MOVE '1' TO SEND-FLAG
               ELSE
                   PERFORM XXXX-UNNESTED-8.

       XXXX-UNNESTED-5.
               IF RESPONSE-CODE = KIKRESP(NORMAL)
                   PERFORM XXXX-UNNESTED-9
               ELSE
                   PERFORM XXXX-UNNESTED-10.

       XXXX-UNNESTED-6.
               IF CUSTOMER-MASTER-RECORD = CA-CUSTOMER-RECORD
                   PERFORM 4100-DELETE-CUSTOMER-RECORD
                   MOVE 'Customer deleted.' TO MSG1O
      *            SET SEND-ERASE TO TRUE
                   MOVE '1' TO SEND-FLAG
               ELSE
                   MOVE 'Another user has updated the record.  Try again
      -                 '.' TO MSG1O
      *            SET SEND-ERASE-ALARM TO TRUE
                   MOVE '2' TO SEND-FLAG.

       XXXX-UNNESTED-7.
               IF RESPONSE-CODE = KIKRESP(NOTFND)
                   MOVE 'Another user has deleted the record.' TO
                       MSG1O
      *            SET SEND-ERASE-ALARM TO TRUE
                   MOVE '2' TO SEND-FLAG.

       XXXX-UNNESTED-8.
                   IF RESPONSE-CODE = KIKRESP(DUPREC)
                       MOVE 'Another user has added a record with that c
      -                    'ustomer number.' TO MSG1O
      *                SET SEND-ERASE-ALARM TO TRUE
                       MOVE '2' TO SEND-FLAG.

       XXXX-UNNESTED-9.
                   IF CUSTOMER-MASTER-RECORD = CA-CUSTOMER-RECORD
                       PERFORM 3200-REWRITE-CUSTOMER-RECORD
                       MOVE 'Customer record updated.' TO MSG1O
      *                SET SEND-ERASE TO TRUE
                       MOVE '1' TO SEND-FLAG
                   ELSE
                       MOVE 'Another user has updated the record.  Try a
      -                     'gain.' TO MSG1O
      *                SET SEND-ERASE-ALARM TO TRUE
                       MOVE '2' TO SEND-FLAG.

       XXXX-UNNESTED-10.
                   IF RESPONSE-CODE = KIKRESP(NOTFND)
                       MOVE 'Another user has deleted the record.' TO
                           MSG1O
      *                SET SEND-ERASE-ALARM TO TRUE
                       MOVE '2' TO SEND-FLAG.

       XXXX-UNNESTED-11.
                   IF PROCESS-KEY-MAP
                       EXEC KICKS
                           XCTL PROGRAM('INVMENU')
                       END-EXEC
                   ELSE
                       MOVE LOW-VALUE TO MNTMAP1O
                       MOVE -1 TO CUSTNO1L
      *                SET SEND-ERASE TO TRUE
                       MOVE '1' TO SEND-FLAG
                       PERFORM 1500-SEND-KEY-MAP
      *                SET PROCESS-KEY-MAP TO TRUE
                       MOVE '1' TO CA-CONTEXT-FLAG.

       XXXX-UNNESTED-12.
                   IF PROCESS-KEY-MAP
                       MOVE LOW-VALUE TO MNTMAP1O
                       MOVE -1 TO CUSTNO1L
      *                SET SEND-ERASE TO TRUE
                       MOVE '1' TO SEND-FLAG
                       PERFORM 1500-SEND-KEY-MAP
                   ELSE
                       MOVE LOW-VALUE TO MNTMAP2O
                       MOVE CA-CUSTOMER-NUMBER TO CUSTNO2O
                       PERFORM XXXX-UNNESTED-1
                       MOVE -1 TO LNAMEL
      *                SET SEND-ERASE TO TRUE
                       MOVE '1' TO SEND-FLAG
                       PERFORM 1400-SEND-DATA-MAP.

       XXXX-UNNESTED-13.
                   IF PROCESS-KEY-MAP
                       MOVE LOW-VALUE TO MNTMAP1O
                       MOVE 'That key is unassigned.' TO MSG1O
                       MOVE -1 TO CUSTNO1L
      *                SET SEND-DATAONLY-ALARM TO TRUE
                       MOVE '4' TO SEND-FLAG
                       PERFORM 1500-SEND-KEY-MAP
                   ELSE
                       MOVE LOW-VALUE TO MNTMAP2O
                       MOVE 'That key is unassigned.' TO MSG2O
                       MOVE -1 TO LNAMEL
      *                SET SEND-DATAONLY-ALARM TO TRUE
                       MOVE '4' TO SEND-FLAG
                       PERFORM 1400-SEND-DATA-MAP.

       XXXX-UNNESTED-14.
                           IF RESPONSE-CODE = KIKRESP(NORMAL)
                               MOVE 'That customer already exists.'
                                    TO MSG1O
                               MOVE 'N' TO VALID-DATA-SW.

       XXXX-UNNESTED-15.
                       IF RESPONSE-CODE = KIKRESP(NOTFND)
                           MOVE ADD-INSTRUCTION TO INSTR2O
      *                    SET PROCESS-ADD-CUSTOMER TO TRUE
                           MOVE '2' TO CA-CONTEXT-FLAG
                           MOVE SPACE TO CUSTOMER-MASTER-RECORD
                       ELSE
                           PERFORM XXXX-UNNESTED-14.

       XXXX-UNNESTED-16.
                           IF RESPONSE-CODE = KIKRESP(NOTFND)
                               MOVE 'That customer does not exist.' TO
                                   MSG1O
                               MOVE 'N' TO VALID-DATA-SW.

       XXXX-UNNESTED-17.
                       IF RESPONSE-CODE = KIKRESP(NORMAL)
                           MOVE CUSTOMER-MASTER-RECORD TO
                               CA-CUSTOMER-RECORD
                           MOVE CHANGE-INSTRUCTION TO INSTR2O
      *                    SET PROCESS-CHANGE-CUSTOMER TO TRUE
                           MOVE '3' TO CA-CONTEXT-FLAG
                       ELSE
                           PERFORM XXXX-UNNESTED-16.

       XXXX-UNNESTED-18.
                           IF RESPONSE-CODE = KIKRESP(NOTFND)
                               MOVE 'That customer does not exist.' TO
                                   MSG1O
                               MOVE 'N' TO VALID-DATA-SW.

       XXXX-UNNESTED-19.
                       IF RESPONSE-CODE = KIKRESP(NORMAL)
                           MOVE CUSTOMER-MASTER-RECORD TO
                               CA-CUSTOMER-RECORD
                           MOVE DELETE-INSTRUCTION TO INSTR2O
      *                    SET PROCESS-DELETE-CUSTOMER TO TRUE
                           MOVE '4' TO CA-CONTEXT-FLAG
                           MOVE ATTR-PROT TO LNAMEA
                                             FNAMEA
                                             ADDRA
                                             CITYA
                                             STATEA
                                             ZIPCODEA
                       ELSE
                           PERFORM XXXX-UNNESTED-18.
