       IDENTIFICATION DIVISION.

       PROGRAM-ID.  INTEDIT.

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       WORKING-STORAGE SECTION.

       01  WORK-FIELDS.

           05  INTEGER-PART        PIC 9(05).
           05  INTEGER-LENGTH      PIC S9(03)  COMP-3.

       LINKAGE SECTION.

       01  UNEDITED-NUMBER         PIC X(5).

       01  UN4 REDEFINES UNEDITED-NUMBER.

           05 UNUM4                PIC X(4).

           05 FILLER               PIC X.

       01  UN3 REDEFINES UNEDITED-NUMBER.

           05 UNUM3                PIC X(3).

           05 FILLER               PIC X(2).

       01  UN2 REDEFINES UNEDITED-NUMBER.

           05 UNUM2                PIC X(2).

           05 FILLER               PIC X(3).

       01  UN1 REDEFINES UNEDITED-NUMBER.

           05 UNUM1                PIC X.

           05 FILLER               PIC X(4).


       01  EDITED-NUMBER           PIC 9(05).

       01  VALID-NUMBER-SW         PIC X(01).
           88  VALID-NUMBER        VALUE 'Y'.

       PROCEDURE DIVISION USING UNEDITED-NUMBER
                                EDITED-NUMBER
                                VALID-NUMBER-SW.

       0000-EDIT-NUMBER.

           MOVE ZERO TO INTEGER-LENGTH.
      *    INSPECT UNEDITED-NUMBER
           EXAMINE UNEDITED-NUMBER
               REPLACING LEADING SPACE BY ZERO.
      *    INSPECT UNEDITED-NUMBER
      *        TALLYING INTEGER-LENGTH FOR CHARACTERS

      *            BEFORE INITIAL SPACE.

      *    IF UNEDITED-NUMBER(1:INTEGER-LENGTH) NUMERIC

      *        MOVE UNEDITED-NUMBER(1:INTEGER-LENGTH)

      *            TO EDITED-NUMBER

      *        MOVE 'Y' TO VALID-NUMBER-SW



           IF UNEDITED-NUMBER IS NUMERIC

               MOVE UNEDITED-NUMBER TO EDITED-NUMBER

               MOVE 'Y' TO VALID-NUMBER-SW

           ELSE

           IF UNUM4 IS NUMERIC

               MOVE UNUM4 TO EDITED-NUMBER

               MOVE 'Y' TO VALID-NUMBER-SW

           ELSE

           IF UNUM3 IS NUMERIC

               MOVE UNUM3 TO EDITED-NUMBER

               MOVE 'Y' TO VALID-NUMBER-SW

           ELSE

           IF UNUM2 IS NUMERIC

               MOVE UNUM2 TO EDITED-NUMBER

               MOVE 'Y' TO VALID-NUMBER-SW

           ELSE

           IF UNUM1 IS NUMERIC

               MOVE UNUM1 TO EDITED-NUMBER

               MOVE 'Y' TO VALID-NUMBER-SW


           ELSE
               MOVE 'N' TO VALID-NUMBER-SW.
      *    END-IF.


       0000-EXIT.

           EXIT PROGRAM.
