//CRLPPGM JOB  CLASS=C,MSGCLASS=A,MSGLEVEL=(1,1),REGION=7000K
//*
//JOBPROC DD   DSN=K.S.V1R5M0.PROCLIB,DISP=SHR
//*
//CRLPPGM EXEC PROC=KGCC,LOPTS='XREF,MAP',NAME=CRLPPGM,
// LLIB='K.S.V1R5M0.KIKRPL'
//COPY.SYSUT1 DD DISP=SHR,DSN=K.X.ROOT.C(CRLPPGM)
//LKED.SYSLIN DD DSN=&&OBJSET,DISP=(OLD,DELETE)
// DD *
 ENTRY CRLPPGM
/*
//

