//FB2VB JOB  CLASS=C,MSGCLASS=A,MSGLEVEL=(1,1),REGION=5000K
//*
//JOBPROC DD   DSN=K.S.V1R5M0.PROCLIB,DISP=SHR
//*
//FB2VB   EXEC PROC=KGCC,LOPTS='XREF,MAP',NAME=FB2VB
//COPY.SYSUT1 DD DSN=K.X.UTIL(FB2VB),DISP=SHR
//LKED.SYSLIN DD DSN=&&OBJSET,DISP=(OLD,DELETE)
// DD *
 ENTRY @@CRT0
/*
//
