//KIKCRLP JOB  CLASS=C,MSGCLASS=A,MSGLEVEL=(1,1),REGION=7000K
//*
//JOBPROC DD   DSN=K.S.V1R5M0.PROCLIB,DISP=SHR
//*
//KIKCRLP  EXEC KGCC,NAME=KIKCRLP
//COPY.SYSUT1 DD DSN=K.X.ROOT.C(KIKCRLP),DISP=SHR
// DD DSN=K.X.ROOT.CPART(RDJFCB),DISP=SHR
//
