//KIKDCP  JOB  CLASS=C,MSGCLASS=A,MSGLEVEL=(1,1),REGION=7000K
//*
//JOBPROC DD   DSN=K.S.V1R5M0.PROCLIB,DISP=SHR
//*
//KIKDCP EXEC PROC=KGCC,NAME=KIKDCP0$
//COPY.SYSUT1 DD DISP=SHR,DSN=K.X.ROOT.C(KIKDCP0$)
//LKED.SYSLIN DD DSN=&&OBJSET,DISP=(OLD,DELETE)
// DD *
 ENTRY KIKDCP
/*
//
