//KIKDCP  JOB  CLASS=C,MSGCLASS=A,MSGLEVEL=(1,1),REGION=7000K
//*
//JOBPROC DD   DSN=K.S.V1R5M0.PROCLIB,DISP=SHR
//*
//KIKDCP EXEC PROC=KGCC,NAME=KIKDCP1$
//COPY.SYSUT1 DD DISP=SHR,DSN=K.X.ROOT.C(KIKDCP1$)
// DD DISP=SHR,DSN=K.X.ROOT.CPART(RDJFCB)
//LKED.SYSLIN DD DSN=&&OBJSET,DISP=(OLD,DELETE)
// DD *
 INCLUDE SKIKLOAD(SVC99)
 ENTRY KIKDCP
/*
//
