//KIKLOAD JOB  CLASS=C,MSGCLASS=A,MSGLEVEL=(1,1),REGION=7000K
//*
//JOBPROC DD   DSN=K.S.V1R5M0.PROCLIB,DISP=SHR
//*
//KIKLOAD   EXEC KGCC,NAME=KIKLOAD
//COPY.SYSUT1 DD DSN=K.X.ROOT.C(KIKLOAD),DISP=SHR
//
