//KIKPCP  JOB  CLASS=C,MSGCLASS=A,MSGLEVEL=(1,1),REGION=7000K
//*
//JOBPROC DD   DSN=K.S.V1R5M0.PROCLIB,DISP=SHR
//*
//KIKPCP EXEC PROC=KGCC,NAME=KIKPCP1$
//COPY.SYSUT1 DD DSN=K.X.ROOT.C(KIKPCP1$),DISP=SHR
//LKED.SYSLIN DD DSN=&&OBJSET,DISP=(OLD,DELETE)
// DD *
 INCLUDE SKIKLOAD(SVC99)
 INCLUDE SKIKLOAD(KIKACP)
 ENTRY KIKPCP
/*
//
