//KIKTCP  JOB  CLASS=C,MSGCLASS=A,MSGLEVEL=(1,1),REGION=7000K
//*
//JOBPROC DD   DSN=K.S.V1R5M0.PROCLIB,DISP=SHR
//*
//KIKTCP EXEC PROC=KGCC,NAME=KIKTCP1$
//COPY.SYSUT1 DD DSN=K.X.ROOT.C(KIKTCP1$),DISP=SHR
//  DD DSN=K.X.ROOT.CPART(ENCODE32),DISP=SHR
//LKED.SYSLIN DD DSN=&&OBJSET,DISP=(OLD,DELETE)
// DD *
 INCLUDE SKIKLOAD(KIKCRLP)
 ENTRY KIKTCP
/*
//
