//KIKTSP  JOB  CLASS=C,MSGCLASS=A,MSGLEVEL=(1,1),REGION=7000K
//*
//JOBPROC DD   DSN=K.S.V1R5M0.PROCLIB,DISP=SHR
//*
//KIKTSP EXEC PROC=KGCC,NAME=KIKTSP0$
//COPY.SYSUT1 DD DSN=K.X.ROOT.C(KIKTSP0$),DISP=SHR
//LKED.SYSLIN DD DSN=&&OBJSET,DISP=(OLD,DELETE)
// DD *
 ENTRY KIKTSP
/*
//
