//LSTLINES JOB  CLASS=C,MSGCLASS=A,MSGLEVEL=(1,1),REGION=5000K
//*
//JOBPROC DD   DSN=K.S.V1R5M0.PROCLIB,DISP=SHR
//*
//LSTLINES EXEC PROC=KGCC,LOPTS='XREF,MAP',NAME=LSTLINES
//COPY.SYSUT1 DD DSN=K.X.UTIL(LSTLINES),DISP=SHR
//LKED.SYSLIN DD DSN=&&OBJSET,DISP=(OLD,DELETE)
// DD *
 ENTRY @@CRT0
/*
//
