//STKCARDS JOB  CLASS=C,MSGCLASS=A,MSGLEVEL=(1,1),REGION=7000K
//*
//JOBPROC DD   DSN=K.S.V1R5M0.PROCLIB,DISP=SHR
//*
//STKCARDS EXEC PROC=KGCC,LOPTS='XREF,MAP',NAME=STKCARDS
//COPY.SYSUT1 DD DSN=K.X.UTIL(STKCARDS),DISP=SHR
//LKED.SYSLIN DD DSN=&&OBJSET,DISP=(OLD,DELETE)
// DD *
 ENTRY @@CRT0
/*
//
