COM='S CMD1'
COM='S BSPSETPF,PARM=NOREPLYU'
COM='S BSPPILOT,PARM=NOWTO'
//UPD2    EXEC PGM=IEBUPDTE,PARM=NEW
//SYSPRINT DD SYSOUT=*
//SYSUT2   DD DSN=SYS1.PROCLIB,DISP=SHR
//SYSIN  DD  DATA,DLM=XX
