//CMDPROC JOB  CLASS=C,MSGCLASS=A,MSGLEVEL=(1,1)
//*
// EXEC PGM=IEBCOPY
//SYSPRINT DD SYSOUT=*
//SYS1     DD DSN=SYS1.CMDPROC,DISP=SHR
//KICKS    DD DSN=K.S.V1R5M0.CLIST,DISP=SHR
//SYSIN    DD *
 COPY INDD=((KICKS,R)),OUTDD=SYS1
 SELECT MEMBER=KICKS
/*
//
