//KCEEULNK JOB CLASS=C,MSGCLASS=A,MSGLEVEL=(1,1)
//*
//LKED     EXEC PGM=IEWL,PARM='XREF,MAP,LET,NCAL'
//SYSLIN   DD DSN=K.S.V1R5M0.INSTLIB(KCEEDECK),DISP=SHR
//SYSIN    DD DUMMY
//SYSLMOD  DD DSN=K.S.V1R5M0.SKIKLOAD(KCEEUOPT),DISP=SHR
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSPRINT DD SYSOUT=*
/*
//
