//PROCLIB JOB  CLASS=C,MSGCLASS=A,MSGLEVEL=(1,1)
//*
// EXEC PGM=IEBCOPY
//SYSPRINT DD SYSOUT=*
//SYS1     DD DSN=SYS1.PROCLIB,DISP=SHR
//KICKS    DD DSN=K.S.V1R5M0.PROCLIB,DISP=SHR
//SYSIN    DD *
 COPY INDD=((KICKS,R)),OUTDD=SYS1
 SELECT MEMBER=K2KCOBCL
 SELECT MEMBER=K2KCOBCS
 SELECT MEMBER=KIKCOBCL
 SELECT MEMBER=KIKGCCCL
 SELECT MEMBER=KIKGCCCS
 SELECT MEMBER=KIKMAPS
/*
//
